[
    {
        "name": "Жим штанги лёжа",
        "description": "Одно из базовых упражнений в тренажёрном зале и в силовых видах спорта. Упражнение комплексно прорабатывает грудные мышцы, передние дельты и трицепсы, создавая мощную нагрузку на всю верхнюю часть тела. При правильной технике выполнения основная нагрузка приходится на среднюю часть большой грудной мышцы, что способствует развитию силы и массы груди. Жим лежа является основным упражнением в пауэрлифтинге и бодибилдинге, а также отлично развивает функциональную силу верхней части тела.",
        "muscles": [
            {
                "code": "top.chest.pectoralis_major.middle",
                "is_primary": true
            },
            {
                "code": "top.chest.pectoralis_major.top",
                "is_primary": false
            },
            {
                "code": "top.chest.pectoralis_major.bottom",
                "is_primary": false
            },
            {
                "code": "top.upper.deltoideus.front",
                "is_primary": false
            },
            {
                "code": "top.hands.triceps.lateral",
                "is_primary": false
            },
            {
                "code": "top.hands.triceps.medial",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Жим штанги лёжа узким хватом",
        "description": "Вариация жима лёжа с узкой постановкой рук, которая смещает акцент нагрузки на трицепсы и внутреннюю часть груди. При выполнении упражнения локти должны двигаться вдоль корпуса, что обеспечивает максимальную изоляцию трицепсов. Это упражнение отлично подходит для развития силы и массы задней поверхности рук. Рекомендуется выполнять после базовых жимовых движений для дополнительной проработки трицепсов.",
        "muscles": [
            {
                "code": "top.hands.triceps.lateral",
                "is_primary": true
            },
            {
                "code": "top.hands.triceps.medial",
                "is_primary": true
            },
            {
                "code": "top.hands.triceps.long",
                "is_primary": false
            },
            {
                "code": "top.chest.pectoralis_major.middle",
                "is_primary": false
            },
            {
                "code": "top.chest.pectoralis_major.top",
                "is_primary": false
            },
            {
                "code": "top.chest.pectoralis_major.bottom",
                "is_primary": false
            },
            {
                "code": "top.upper.deltoideus.front",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Жим штанги на наклонной скамье (голова вверх)",
        "description": "Упражнение для развития верхней части грудных мышц, которое выполняется на скамье с положительным наклоном 30-45 градусов. При таком угле наклона основная нагрузка приходится на верхние пучки большой грудной мышцы, что позволяет создать красивый рельеф верхней части груди. Упражнение также задействует передние дельты и трицепсы в качестве вспомогательных мышц. Важно контролировать движение и не допускать полного выпрямления рук в верхней точке для сохранения постоянного напряжения в мышцах.",
        "muscles": [
            {
                "code": "top.chest.pectoralis_major.top",
                "is_primary": true
            },
            {
                "code": "top.chest.pectoralis_major.middle",
                "is_primary": false
            },
            {
                "code": "top.upper.deltoideus.front",
                "is_primary": false
            },
            {
                "code": "top.hands.triceps.lateral",
                "is_primary": false
            },
            {
                "code": "top.hands.triceps.medial",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Жим штанги на наклонной скамье (голова вниз)",
        "description": "Упражнение для целенаправленной проработки нижней части грудных мышц, выполняемое на скамье с отрицательным наклоном. При таком положении основная нагрузка смещается на нижние пучки большой грудной мышцы, что способствует формированию мощной нижней части груди. Упражнение требует хорошей координации и контроля, так как работа в перевернутом положении создает дополнительную нагрузку на вестибулярный аппарат. Рекомендуется использовать меньшие веса, чем в классическом жиме лежа, для обеспечения безопасности и правильной техники выполнения.",
        "muscles": [
            {
                "code": "top.chest.pectoralis_major.bottom",
                "is_primary": true
            },
            {
                "code": "top.chest.pectoralis_major.middle",
                "is_primary": false
            },
            {
                "code": "top.upper.deltoideus.front",
                "is_primary": false
            },
            {
                "code": "top.hands.triceps.lateral",
                "is_primary": false
            },
            {
                "code": "top.hands.triceps.medial",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Сведение гантелей перед собой лёжа",
        "description": "Изолирующее упражнение для растяжки и проработки грудных мышц, которое выполняется с гантелями в положении лежа на горизонтальной скамье. Упражнение отлично подходит для улучшения эластичности мышц груди и создания глубокого мышечного пампа. При выполнении важно контролировать движение и не допускать чрезмерного разведения рук, чтобы избежать травм плечевых суставов. Разводка гантелей позволяет максимально растянуть грудные мышцы в нижней точке и сконцентрированно сократить их в верхней точке движения.",
        "muscles": [
            {
                "code": "top.chest.pectoralis_major.middle",
                "is_primary": true
            },
            {
                "code": "top.chest.pectoralis_major.top",
                "is_primary": false
            },
            {
                "code": "top.chest.pectoralis_major.bottom",
                "is_primary": false
            },
            {
                "code": "top.upper.deltoideus.front",
                "is_primary": false
            },
            {
                "code": "top.chest.additional.serratus_anterior",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Отжимания на брусьях",
        "description": "Базовое упражнение для развития груди, трицепсов и передних дельт, которое можно выполнять как с собственным весом, так и с дополнительным отягощением. При наклоне корпуса вперед основная нагрузка смещается на грудные мышцы, а при вертикальном положении корпуса - на трицепсы. Упражнение отлично развивает функциональную силу и координацию движений. Для увеличения нагрузки можно использовать пояс с дополнительными весами или выполнять упражнение в медленном темпе с паузами в нижней точке.",
        "muscles": [
            {
                "code": "top.chest.pectoralis_major.middle",
                "is_primary": true
            },
            {
                "code": "top.chest.pectoralis_major.bottom",
                "is_primary": true
            },
            {
                "code": "top.hands.triceps.lateral",
                "is_primary": true
            },
            {
                "code": "top.hands.triceps.medial",
                "is_primary": false
            },
            {
                "code": "top.upper.deltoideus.front",
                "is_primary": false
            },
            {
                "code": "top.hands.triceps.long",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Подтягивания широким хватом",
        "description": "Одно из лучших упражнений для развития широчайших мышц спины и верхней части тела, которое выполняется на перекладине с широкой постановкой рук. При правильной технике выполнения основная нагрузка приходится на широчайшие мышцы спины, что способствует формированию V-образной фигуры. Упражнение также задействует бицепсы, задние дельты и ромбовидные мышцы в качестве вспомогательных. Для максимальной эффективности важно выполнять полную амплитуду движения - от полного виса до касания перекладины грудью.",
        "muscles": [
            {
                "code": "top.back.latissimus_dorsi.top",
                "is_primary": true
            },
            {
                "code": "top.back.latissimus_dorsi.bottom",
                "is_primary": true
            },
            {
                "code": "top.back.rhomboids.middle",
                "is_primary": false
            },
            {
                "code": "top.hands.biceps.long",
                "is_primary": false
            },
            {
                "code": "top.hands.biceps.short",
                "is_primary": false
            },
            {
                "code": "top.upper.deltoideus.back",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Тяга штанги в наклоне прямым хватом",
        "description": "Базовое упражнение для развития толщины спины, которое выполняется со штангой в наклоне вперед. Упражнение комплексно прорабатывает все мышцы спины, включая широчайшие, ромбовидные и трапециевидные мышцы. При правильной технике выполнения создается мощная нагрузка на среднюю часть спины, что способствует улучшению осанки и развитию мышечной массы. Важно держать спину прямой на протяжении всего движения и тянуть штангу к нижней части живота для максимальной активации мышц спины.",
        "muscles": [
            {
                "code": "top.back.latissimus_dorsi.bottom",
                "is_primary": true
            },
            {
                "code": "top.back.rhomboids.middle",
                "is_primary": true
            },
            {
                "code": "top.back.trapezius.middle",
                "is_primary": false
            },
            {
                "code": "top.back.trapezius.bottom",
                "is_primary": false
            },
            {
                "code": "top.hands.biceps.long",
                "is_primary": false
            },
            {
                "code": "top.hands.biceps.short",
                "is_primary": false
            },
            {
                "code": "top.upper.deltoideus.back",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Тяга верхнего блока к груди",
        "description": "Упражнение для развития широчайших мышц спины, которое является альтернативой подтягиваниям для тех, кто еще не может выполнять их с собственным весом. Упражнение позволяет точно дозировать нагрузку и работать в комфортной амплитуде движения. При тяге блока к груди основная нагрузка приходится на верхние и средние пучки широчайших мышц, а также на ромбовидные мышцы. Упражнение отлично подходит для новичков и для завершения тренировки спины после базовых упражнений.",
        "muscles": [
            {
                "code": "top.back.latissimus_dorsi.top",
                "is_primary": true
            },
            {
                "code": "top.back.latissimus_dorsi.bottom",
                "is_primary": true
            },
            {
                "code": "top.back.rhomboids.middle",
                "is_primary": false
            },
            {
                "code": "top.hands.biceps.long",
                "is_primary": false
            },
            {
                "code": "top.hands.biceps.short",
                "is_primary": false
            },
            {
                "code": "top.upper.deltoideus.back",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Тяга Т-грифа",
        "description": "Эффективное упражнение для развития толщины и детализации мышц спины, которое выполняется на специальном тренажере или со штангой в углу. Упражнение позволяет работать с большими весами при минимальной нагрузке на поясницу, так как корпус зафиксирован. При выполнении тяги Т-грифа основная нагрузка приходится на среднюю часть спины, включая ромбовидные и средние пучки трапеций. Упражнение отлично подходит для создания мощной и рельефной спины, особенно в средней ее части.",
        "muscles": [
            {
                "code": "top.back.rhomboids.middle",
                "is_primary": true
            },
            {
                "code": "top.back.trapezius.middle",
                "is_primary": true
            },
            {
                "code": "top.back.latissimus_dorsi.bottom",
                "is_primary": true
            },
            {
                "code": "top.hands.biceps.long",
                "is_primary": false
            },
            {
                "code": "top.hands.biceps.short",
                "is_primary": false
            },
            {
                "code": "top.back.trapezius.bottom",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Шраги со штангой",
        "description": "Специализированное упражнение для развития трапециевидных мышц, которое выполняется путем поднятия плеч вверх с отягощением. Упражнение целенаправленно прорабатывает верхние и средние пучки трапеций, создавая мощный и рельефный верх спины. При выполнении важно поднимать плечи строго вверх, без вращательных движений, чтобы максимально изолировать трапециевидные мышцы. Шраги можно выполнять со штангой, гантелями или на специальном тренажере, что позволяет варьировать нагрузку и угол воздействия.",
        "muscles": [
            {
                "code": "top.back.trapezius.top",
                "is_primary": true
            },
            {
                "code": "top.back.trapezius.middle",
                "is_primary": true
            },
            {
                "code": "top.back.trapezius.bottom",
                "is_primary": false
            },
            {
                "code": "top.head.neck.middle",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Жим штанги стоя (армейский жим)",
        "description": "Базовое упражнение для развития плечевого пояса, которое выполняется со штангой в положении стоя. Упражнение комплексно прорабатывает передние и средние дельты, а также трицепсы и верхнюю часть груди. При выполнении стоя создается дополнительная нагрузка на мышцы кора и стабилизаторы, что делает упражнение более функциональным. Армейский жим отлично развивает силу и массу плеч, а также улучшает осанку и координацию движений.",
        "muscles": [
            {
                "code": "top.upper.deltoideus.front",
                "is_primary": true
            },
            {
                "code": "top.upper.deltoideus.middle",
                "is_primary": true
            },
            {
                "code": "top.hands.triceps.lateral",
                "is_primary": true
            },
            {
                "code": "top.hands.triceps.medial",
                "is_primary": false
            },
            {
                "code": "top.chest.pectoralis_major.top",
                "is_primary": false
            },
            {
                "code": "top.back.trapezius.top",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Махи гантелями в стороны",
        "description": "Изолирующее упражнение для развития средних пучков дельтовидных мышц, которое выполняется с гантелями в положении стоя или сидя. Упражнение позволяет целенаправленно проработать средние дельты, которые отвечают за ширину плеч и создание атлетической фигуры. При правильной технике выполнения важно поднимать гантели до уровня плеч, не выше, чтобы избежать травм и максимально нагрузить целевые мышцы. Махи в стороны отлично подходят для завершения тренировки плеч и создания рельефа средних дельт.",
        "muscles": [
            {
                "code": "top.upper.deltoideus.middle",
                "is_primary": true
            },
            {
                "code": "top.upper.deltoideus.front",
                "is_primary": false
            },
            {
                "code": "top.back.trapezius.top",
                "is_primary": false
            },
            {
                "code": "top.upper.cuff_rotators.supraspinatus",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Махи гантелями в наклоне",
        "description": "Изолирующее упражнение для развития задних пучков дельтовидных мышц, которое выполняется в наклоне вперед с гантелями. Упражнение целенаправленно прорабатывает задние дельты, которые часто отстают в развитии у многих атлетов. При выполнении важно держать спину прямой и разводить руки в стороны, а не назад, для максимальной активации задних дельт. Махи в наклоне отлично подходят для создания сбалансированного развития всех пучков дельтовидных мышц и улучшения осанки.",
        "muscles": [
            {
                "code": "top.upper.deltoideus.back",
                "is_primary": true
            },
            {
                "code": "top.back.trapezius.middle",
                "is_primary": false
            },
            {
                "code": "top.back.rhomboids.middle",
                "is_primary": false
            },
            {
                "code": "top.upper.cuff_rotators.infraspinatus",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Подъем штанги на бицепс",
        "description": "Классическое упражнение для развития бицепсов, которое выполняется со штангой в положении стоя. Упражнение комплексно прорабатывает обе головки бицепса, создавая мощную и рельефную переднюю поверхность рук. При выполнении важно контролировать движение и не раскачивать корпус, чтобы максимально изолировать бицепсы и обеспечить качественную проработку мышц. Подъем штанги на бицепс является основным упражнением для развития силы и массы бицепсов.",
        "muscles": [
            {
                "code": "top.hands.biceps.long",
                "is_primary": true
            },
            {
                "code": "top.hands.biceps.short",
                "is_primary": true
            },
            {
                "code": "top.hands.biceps.brachialis",
                "is_primary": false
            },
            {
                "code": "top.hands.forearms.brachioradialis",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Молотковые сгибания с гантелями",
        "description": "Упражнение для развития брахиалиса и брахиорадиалиса, которое выполняется с гантелями в нейтральном хвате. Упражнение создает уникальную нагрузку на мышцы предплечья и брахиалис, что способствует увеличению общего объема рук. При выполнении молотковых сгибаний локти должны быть зафиксированы, а движение происходит только в локтевых суставах. Это упражнение отлично дополняет классические подъемы на бицепс и помогает создать более объемные и рельефные руки.",
        "muscles": [
            {
                "code": "top.hands.biceps.brachialis",
                "is_primary": true
            },
            {
                "code": "top.hands.forearms.brachioradialis",
                "is_primary": true
            },
            {
                "code": "top.hands.biceps.long",
                "is_primary": false
            },
            {
                "code": "top.hands.biceps.short",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Французский жим лежа",
        "description": "Изолирующее упражнение для развития трицепсов, которое выполняется со штангой или гантелями в положении лежа. Упражнение целенаправленно прорабатывает все три головки трицепса, создавая мощную заднюю поверхность рук. При выполнении важно держать локти зафиксированными и не разводить их в стороны, чтобы максимально изолировать трицепсы. Французский жим отлично подходит для детальной проработки трицепсов и создания рельефа задней поверхности рук.",
        "muscles": [
            {
                "code": "top.hands.triceps.long",
                "is_primary": true
            },
            {
                "code": "top.hands.triceps.lateral",
                "is_primary": true
            },
            {
                "code": "top.hands.triceps.medial",
                "is_primary": true
            }
        ]
    },
    {
        "name": "Разгибания рук на блоке",
        "description": "Изолирующее упражнение для проработки трицепсов, которое выполняется на блочном тренажере с канатной рукоятью или прямой перекладиной. Упражнение позволяет точно дозировать нагрузку и работать в комфортной амплитуде движения, максимально изолируя трицепсы. При выполнении важно держать локти прижатыми к корпусу и разгибать руки до полного выпрямления для максимальной активации всех головок трицепса. Разгибания на блоке отлично подходят для завершения тренировки трицепсов и создания пампа.",
        "muscles": [
            {
                "code": "top.hands.triceps.medial",
                "is_primary": true
            },
            {
                "code": "top.hands.triceps.lateral",
                "is_primary": true
            },
            {
                "code": "top.hands.triceps.long",
                "is_primary": true
            }
        ]
    },
    {
        "name": "Приседания со штангой",
        "description": "Король всех упражнений для развития нижней части тела, которое комплексно прорабатывает квадрицепсы, ягодичные мышцы и бицепсы бедер. Приседания со штангой являются одним из самых эффективных упражнений для набора общей мышечной массы и силы всего тела. Упражнение также задействует мышцы кора и стабилизаторы, создавая мощную нагрузку на весь организм. При правильной технике выполнения приседания способствуют улучшению мобильности суставов, укреплению связок и развитию функциональной силы.",
        "muscles": [
            {
                "code": "bottom.legs.quadriceps.rectus_femoris",
                "is_primary": true
            },
            {
                "code": "bottom.legs.quadriceps.vastus_lateralis",
                "is_primary": true
            },
            {
                "code": "bottom.legs.quadriceps.vastus_medialis",
                "is_primary": true
            },
            {
                "code": "bottom.legs.gluteus.maximus",
                "is_primary": true
            },
            {
                "code": "bottom.legs.quadriceps.vastus_intermedius",
                "is_primary": false
            },
            {
                "code": "bottom.legs.hamstrings.long",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Жим ногами в тренажере",
        "description": "Эффективное упражнение для развития мышц ног, которое выполняется на специальном тренажере и позволяет работать с большими весами при минимальной нагрузке на позвоночник. Упражнение комплексно прорабатывает квадрицепсы, ягодичные мышцы и бицепсы бедер, создавая мощную нагрузку на всю нижнюю часть тела. При выполнении жима ногами можно варьировать постановку ног на платформе для смещения акцента нагрузки на разные группы мышц. Упражнение отлично подходит для тех, кто не может выполнять приседания из-за проблем со спиной или для дополнительной проработки ног.",
        "muscles": [
            {
                "code": "bottom.legs.quadriceps.vastus_lateralis",
                "is_primary": true
            },
            {
                "code": "bottom.legs.quadriceps.rectus_femoris",
                "is_primary": true
            },
            {
                "code": "bottom.legs.quadriceps.vastus_medialis",
                "is_primary": true
            },
            {
                "code": "bottom.legs.gluteus.maximus",
                "is_primary": true
            },
            {
                "code": "bottom.legs.quadriceps.vastus_intermedius",
                "is_primary": false
            },
            {
                "code": "bottom.legs.hamstrings.long",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Выпады со штангой",
        "description": "Функциональное упражнение для развития ног и ягодиц, которое выполняется с шагом вперед или назад с отягощением. Упражнение отлично развивает баланс, координацию и силу ног, создавая нагрузку на каждую ногу по отдельности. При выполнении выпадов основная нагрузка приходится на переднюю ногу, которая работает в режиме приседания, что способствует развитию квадрицепсов и ягодичных мышц. Выпады также задействуют мышцы кора и стабилизаторы, делая упражнение более функциональным и полезным для общего развития.",
        "muscles": [
            {
                "code": "bottom.legs.quadriceps.rectus_femoris",
                "is_primary": true
            },
            {
                "code": "bottom.legs.gluteus.maximus",
                "is_primary": true
            },
            {
                "code": "bottom.legs.quadriceps.vastus_lateralis",
                "is_primary": true
            },
            {
                "code": "bottom.legs.quadriceps.vastus_medialis",
                "is_primary": false
            },
            {
                "code": "bottom.legs.hamstrings.long",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Румынская тяга",
        "description": "Базовое упражнение для развития задней поверхности бедер и ягодичных мышц, которое выполняется со штангой или гантелями с прямыми или слегка согнутыми ногами. Упражнение отлично растягивает и прорабатывает бицепсы бедер, создавая мощную нагрузку на заднюю цепь мышц. При выполнении румынской тяги важно держать спину прямой и отводить таз назад, чтобы максимально активировать ягодичные мышцы и бицепсы бедер. Упражнение также укрепляет мышцы поясницы и улучшает гибкость задней поверхности бедер.",
        "muscles": [
            {
                "code": "bottom.legs.hamstrings.long",
                "is_primary": true
            },
            {
                "code": "bottom.legs.hamstrings.short",
                "is_primary": true
            },
            {
                "code": "bottom.legs.gluteus.maximus",
                "is_primary": true
            },
            {
                "code": "bottom.legs.hamstrings.semitendinosus",
                "is_primary": false
            },
            {
                "code": "bottom.legs.hamstrings.semimembranosus",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Сгибания ног лежа",
        "description": "Изолирующее упражнение для развития бицепсов бедер, которое выполняется на специальном тренажере в положении лежа. Упражнение целенаправленно прорабатывает заднюю поверхность бедер, создавая детальную нагрузку на все головки бицепсов бедер. При выполнении важно контролировать движение и не использовать инерцию, чтобы максимально изолировать целевые мышцы. Сгибания ног лежа отлично подходят для завершения тренировки ног и создания рельефа задней поверхности бедер.",
        "muscles": [
            {
                "code": "bottom.legs.hamstrings.long",
                "is_primary": true
            },
            {
                "code": "bottom.legs.hamstrings.short",
                "is_primary": true
            },
            {
                "code": "bottom.legs.hamstrings.semitendinosus",
                "is_primary": false
            },
            {
                "code": "bottom.legs.hamstrings.semimembranosus",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Подъемы на носки стоя",
        "description": "Упражнение для развития икроножных мышц, которое выполняется на специальном тренажере или со штангой в положении стоя. Упражнение целенаправленно прорабатывает икроножные мышцы, создавая мощную нагрузку на заднюю поверхность голени. При выполнении важно использовать полную амплитуду движения - от максимального растяжения до полного сокращения икроножных мышц. Подъемы на носки стоя являются основным упражнением для развития силы и массы икр, что важно для создания сбалансированной фигуры.",
        "muscles": [
            {
                "code": "bottom.legs.calves.gastrocnemius",
                "is_primary": true
            },
            {
                "code": "bottom.legs.calves.soleus",
                "is_primary": false
            },
            {
                "code": "bottom.legs.calves.tibialis_anterior",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Подъемы на носки сидя",
        "description": "Упражнение для развития камбаловидных мышц, которое выполняется на специальном тренажере в положении сидя. В отличие от подъемов стоя, это упражнение целенаправленно прорабатывает камбаловидные мышцы, которые находятся под икроножными. При выполнении сидя икроножные мышцы расслаблены, что позволяет максимально изолировать камбаловидные мышцы. Подъемы на носки сидя отлично дополняют подъемы стоя и способствуют созданию полных и рельефных икр.",
        "muscles": [
            {
                "code": "bottom.legs.calves.soleus",
                "is_primary": true
            },
            {
                "code": "bottom.legs.calves.gastrocnemius",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Ягодичный мостик со штангой",
        "description": "Специализированное упражнение для развития ягодичных мышц, которое выполняется лежа на спине с отягощением на тазу. Упражнение целенаправленно прорабатывает большую, среднюю и малую ягодичные мышцы, создавая мощную нагрузку на всю ягодичную группу. При выполнении важно поднимать таз до полного выпрямления бедер и сжимать ягодицы в верхней точке для максимальной активации мышц. Ягодичный мостик отлично подходит для развития силы и массы ягодиц, что важно для создания атлетической фигуры и улучшения спортивных результатов.",
        "muscles": [
            {
                "code": "bottom.legs.gluteus.maximus",
                "is_primary": true
            },
            {
                "code": "bottom.legs.gluteus.medius",
                "is_primary": false
            },
            {
                "code": "bottom.legs.gluteus.minimus",
                "is_primary": false
            },
            {
                "code": "bottom.legs.hamstrings.long",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Скручивания на пресс",
        "description": "Классическое упражнение для развития прямой мышцы живота, которое выполняется лежа на спине с подъемом корпуса. Упражнение целенаправленно прорабатывает верхнюю часть пресса, создавая концентрированную нагрузку на прямую мышцу живота. При выполнении важно не отрывать поясницу от пола и скручивать корпус, а не просто поднимать его, чтобы максимально активировать мышцы пресса. Скручивания отлично подходят для создания рельефного пресса и укрепления мышц кора.",
        "muscles": [
            {
                "code": "top.abdomen.rectus_abdominus.top",
                "is_primary": true
            },
            {
                "code": "top.abdomen.rectus_abdominus.bottom",
                "is_primary": false
            },
            {
                "code": "top.abdomen.obliquus.externus",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Подъемы ног в висе",
        "description": "Упражнение для развития нижней части пресса и мышц кора, которое выполняется в висе на перекладине или в специальных упорах. Упражнение создает мощную нагрузку на прямую мышцу живота, особенно на ее нижнюю часть, а также задействует косые мышцы живота. При выполнении важно контролировать движение и не раскачиваться, чтобы максимально изолировать мышцы пресса. Подъемы ног в висе отлично развивают силу и выносливость мышц кора, что важно для стабильности всего тела.",
        "muscles": [
            {
                "code": "top.abdomen.rectus_abdominus.bottom",
                "is_primary": true
            },
            {
                "code": "top.abdomen.rectus_abdominus.top",
                "is_primary": false
            },
            {
                "code": "top.abdomen.obliquus.externus",
                "is_primary": false
            },
            {
                "code": "top.abdomen.obliquus.internus",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Боковые скручивания",
        "description": "Упражнение для развития косых мышц живота, которое выполняется лежа на боку с подъемом корпуса в сторону. Упражнение целенаправленно прорабатывает наружные и внутренние косые мышцы живота, создавая рельеф боковой части пресса. При выполнении важно скручивать корпус в сторону, а не просто поднимать его, чтобы максимально активировать косые мышцы. Боковые скручивания отлично подходят для создания талии и улучшения стабильности корпуса.",
        "muscles": [
            {
                "code": "top.abdomen.obliquus.externus",
                "is_primary": true
            },
            {
                "code": "top.abdomen.obliquus.internus",
                "is_primary": true
            },
            {
                "code": "top.abdomen.rectus_abdominus.top",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Планка",
        "description": "Статическое упражнение для укрепления мышц кора, которое выполняется в упоре лежа с удержанием прямого положения тела. Упражнение комплексно прорабатывает все мышцы кора, включая прямую мышцу живота, косые мышцы и поперечную мышцу живота. При выполнении планки важно держать тело прямым, не прогибаясь в пояснице и не поднимая таз, чтобы обеспечить равномерную нагрузку на все мышцы кора. Планка отлично развивает стабильность корпуса, что важно для выполнения других упражнений и предотвращения травм.",
        "muscles": [
            {
                "code": "top.abdomen.core.transversus",
                "is_primary": true
            },
            {
                "code": "top.abdomen.rectus_abdominus.top",
                "is_primary": false
            },
            {
                "code": "top.abdomen.rectus_abdominus.bottom",
                "is_primary": false
            },
            {
                "code": "top.abdomen.obliquus.externus",
                "is_primary": false
            },
            {
                "code": "top.abdomen.obliquus.internus",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Тяга нижнего блока к поясу",
        "description": "Упражнение для развития средней части спины, которое выполняется на блочном тренажере сидя с тягой рукояти к поясу. Упражнение целенаправленно прорабатывает ромбовидные мышцы и средние пучки трапеций, создавая детальную нагрузку на среднюю часть спины. При выполнении важно сводить лопатки вместе в конечной точке движения для максимальной активации целевых мышц. Тяга нижнего блока отлично подходит для создания толщины спины и улучшения осанки.",
        "muscles": [
            {
                "code": "top.back.rhomboids.middle",
                "is_primary": true
            },
            {
                "code": "top.back.trapezius.middle",
                "is_primary": true
            },
            {
                "code": "top.back.latissimus_dorsi.bottom",
                "is_primary": true
            },
            {
                "code": "top.hands.biceps.long",
                "is_primary": false
            },
            {
                "code": "top.hands.biceps.short",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Разгибания спины (гиперэкстензия)",
        "description": "Упражнение для развития мышц-разгибателей позвоночника и ягодичных мышц, которое выполняется на специальном тренажере или римском стуле. Упражнение отлично укрепляет нижнюю часть спины, что важно для предотвращения травм и улучшения осанки. При выполнении важно контролировать движение и не переразгибать спину, чтобы избежать травм и максимально активировать целевые мышцы. Гиперэкстензия отлично подходит для разминки перед тяжелыми приседаниями и становой тягой, а также для укрепления поясницы.",
        "muscles": [
            {
                "code": "top.back.erector_spinae.spinalis",
                "is_primary": true
            },
            {
                "code": "top.back.erector_spinae.iliocostalis",
                "is_primary": true
            },
            {
                "code": "top.back.erector_spinae.sartorius",
                "is_primary": true
            },
            {
                "code": "bottom.legs.gluteus.maximus",
                "is_primary": false
            },
            {
                "code": "bottom.legs.hamstrings.long",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Подъемы на бицепс с гантелями сидя",
        "description": "Изолирующее упражнение для развития бицепсов, которое выполняется с гантелями в положении сидя на скамье с наклонной спинкой. Упражнение позволяет максимально изолировать бицепсы и работать в комфортной амплитуде движения без использования читинга. При выполнении можно варьировать угол наклона скамьи и использовать супинацию кисти для дополнительной активации бицепсов. Подъемы с гантелями сидя отлично подходят для детальной проработки бицепсов и создания рельефа передней поверхности рук.",
        "muscles": [
            {
                "code": "top.hands.biceps.long",
                "is_primary": true
            },
            {
                "code": "top.hands.biceps.short",
                "is_primary": true
            },
            {
                "code": "top.hands.biceps.brachialis",
                "is_primary": true
            },
            {
                "code": "top.hands.forearms.brachioradialis",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Жим гантелей лежа",
        "description": "Альтернатива жиму штанги лежа, которая выполняется с гантелями и позволяет работать каждой рукой независимо. Упражнение отлично развивает грудные мышцы, создавая более глубокую растяжку в нижней точке и большую амплитуду движения по сравнению со штангой. При выполнении с гантелями требуется больше стабилизации, что дополнительно задействует мышцы кора и стабилизаторы. Жим гантелей лежа отлично подходит для разнообразия тренировочного процесса и развития симметрии мышц.",
        "muscles": [
            {
                "code": "top.chest.pectoralis_major.middle",
                "is_primary": true
            },
            {
                "code": "top.chest.pectoralis_major.top",
                "is_primary": false
            },
            {
                "code": "top.chest.pectoralis_major.bottom",
                "is_primary": false
            },
            {
                "code": "top.upper.deltoideus.front",
                "is_primary": false
            },
            {
                "code": "top.hands.triceps.lateral",
                "is_primary": false
            },
            {
                "code": "top.hands.triceps.medial",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Тяга гантели одной рукой",
        "description": "Упражнение для развития мышц спины, которое выполняется с гантелью в наклоне с опорой на скамью одной рукой и ногой. Упражнение позволяет работать с большей амплитудой движения и лучше растягивать мышцы спины по сравнению с тягой штанги. При выполнении одной рукой можно лучше сконцентрироваться на работе целевых мышц и обеспечить симметричное развитие обеих сторон спины. Тяга гантели одной рукой отлично подходит для детальной проработки широчайших мышц и создания толщины спины.",
        "muscles": [
            {
                "code": "top.back.latissimus_dorsi.bottom",
                "is_primary": true
            },
            {
                "code": "top.back.latissimus_dorsi.top",
                "is_primary": true
            },
            {
                "code": "top.back.rhomboids.middle",
                "is_primary": true
            },
            {
                "code": "top.hands.biceps.long",
                "is_primary": false
            },
            {
                "code": "top.hands.biceps.short",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Жим ногами с узкой постановкой ног",
        "description": "Вариация жима ногами с узкой постановкой стоп на платформе, которая смещает акцент нагрузки на квадрицепсы. При узкой постановке ног увеличивается нагрузка на переднюю поверхность бедер, что способствует развитию мощных квадрицепсов. Упражнение позволяет работать с большими весами при минимальной нагрузке на позвоночник, что делает его безопасным для людей с проблемами спины. Жим ногами с узкой постановкой отлично подходит для целенаправленной проработки квадрицепсов и создания рельефа передней поверхности бедер.",
        "muscles": [
            {
                "code": "bottom.legs.quadriceps.vastus_lateralis",
                "is_primary": true
            },
            {
                "code": "bottom.legs.quadriceps.rectus_femoris",
                "is_primary": true
            },
            {
                "code": "bottom.legs.quadriceps.vastus_medialis",
                "is_primary": true
            },
            {
                "code": "bottom.legs.quadriceps.vastus_intermedius",
                "is_primary": false
            },
            {
                "code": "bottom.legs.gluteus.maximus",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Жим ногами с широкой постановкой ног",
        "description": "Вариация жима ногами с широкой постановкой стоп на платформе, которая смещает акцент нагрузки на внутреннюю поверхность бедер и ягодичные мышцы. При широкой постановке ног увеличивается нагрузка на приводящие мышцы бедер и ягодицы, что способствует развитию этих мышечных групп. Упражнение отлично подходит для женщин и тех, кто хочет акцентированно проработать ягодичные мышцы и внутреннюю поверхность бедер. Жим ногами с широкой постановкой позволяет работать с большими весами и создавать мощную нагрузку на целевые мышцы.",
        "muscles": [
            {
                "code": "bottom.legs.gluteus.maximus",
                "is_primary": true
            },
            {
                "code": "bottom.legs.adductors.adductor_magnus",
                "is_primary": true
            },
            {
                "code": "bottom.legs.quadriceps.vastus_medialis",
                "is_primary": true
            },
            {
                "code": "bottom.legs.adductors.adductor_longus",
                "is_primary": false
            },
            {
                "code": "bottom.legs.adductors.adductor_brevis",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Разгибания ног в тренажере",
        "description": "Изолирующее упражнение для развития квадрицепсов, которое выполняется на специальном тренажере в положении сидя. Упражнение целенаправленно прорабатывает все четыре головки квадрицепса, создавая детальную нагрузку на переднюю поверхность бедер. При выполнении важно полностью разгибать ноги в верхней точке и контролировать движение в негативной фазе для максимальной активации мышц. Разгибания ног в тренажере отлично подходят для разминки перед приседаниями, завершения тренировки ног и создания рельефа квадрицепсов.",
        "muscles": [
            {
                "code": "bottom.legs.quadriceps.rectus_femoris",
                "is_primary": true
            },
            {
                "code": "bottom.legs.quadriceps.vastus_lateralis",
                "is_primary": true
            },
            {
                "code": "bottom.legs.quadriceps.vastus_medialis",
                "is_primary": true
            },
            {
                "code": "bottom.legs.quadriceps.vastus_intermedius",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Подъемы на носки в тренажере сидя",
        "description": "Специализированное упражнение для развития камбаловидных мышц, которое выполняется на специальном тренажере в положении сидя с фиксацией бедер. В отличие от подъемов стоя, это упражнение полностью изолирует камбаловидные мышцы, так как икроножные мышцы расслаблены в положении сидя. Упражнение позволяет работать с большими весами и создавать мощную нагрузку на камбаловидные мышцы, которые составляют основную массу икр. Подъемы на носки сидя отлично дополняют подъемы стоя и способствуют созданию полных и объемных икр.",
        "muscles": [
            {
                "code": "bottom.legs.calves.soleus",
                "is_primary": true
            },
            {
                "code": "bottom.legs.calves.gastrocnemius",
                "is_primary": false
            }
        ]
    },
    {
        "name": "Сведение рук в тренажере (бабочка)",
        "description": "Изолирующее упражнение для развития грудных мышц, которое выполняется на специальном тренажере для сведения рук. Упражнение целенаправленно прорабатывает внутреннюю часть грудных мышц, создавая мощный пампинг и улучшая детализацию мышц груди. При выполнении важно сводить рукояти тренажера до полного сокращения грудных мышц и контролировать движение в негативной фазе. Сведение рук в тренажере отлично подходит для завершения тренировки груди и создания рельефа внутренней части грудных мышц.",
        "muscles": [
            {
                "code": "top.chest.pectoralis_major.middle",
                "is_primary": true
            },
            {
                "code": "top.chest.pectoralis_major.top",
                "is_primary": false
            },
            {
                "code": "top.chest.pectoralis_major.bottom",
                "is_primary": false
            },
            {
                "code": "top.upper.deltoideus.front",
                "is_primary": false
            }
        ]
    }
]
